In [32]:
import pandas as pd
import numpy as np
from pandas import read_csv
from sklearn.model_selection import KFold
from sklearn.model_selection import cross_val_score
from sklearn.ensemble import RandomForestClassifier

In [33]:
data=pd.read_csv("Fraud_check.csv")
df=pd.DataFrame(data)
df.head()

,Undergrad,Marital.Status,Taxable.Income,City.Population,Work.Experience,Urban
0,NO,Single,68833,50047,10,YES
1,YES,Divorced,33700,134075,18,YES
2,NO,Married,36925,160205,30,YES
3,YES,Single,50190,193264,15,YES
4,NO,Married,81002,27533,28,NO

In [34]:
df['Marital.Status']=df['Marital.Status'].astype('category')
df['Urban']=df['Urban'].astype('category')
df['Undergrad']=df['Undergrad'].astype('category')

In [35]:
df.dtypes

Undergrad          category
Marital.Status     category
Taxable.Income        int64
City.Population       int64
Work.Experience       int64
Urban              category
dtype: object

In [36]:
from sklearn import preprocessing
label_encoder = preprocessing.LabelEncoder() 
df[('Marital.Status')]= label_encoder.fit_transform(df[('Marital.Status')]) 
df[('Undergrad')]=label_encoder.fit_transform(df[('Undergrad')])
df[('Urban')]= label_encoder.fit_transform(df[('Urban')]) 
df.head()

,Undergrad,Marital.Status,Taxable.Income,City.Population,Work.Experience,Urban
0,0,2,68833,50047,10,1
1,1,0,33700,134075,18,1
2,0,1,36925,160205,30,1
3,1,2,50190,193264,15,1
4,0,1,81002,27533,28,0

In [37]:
df.dtypes

Undergrad          int32
Marital.Status     int32
Taxable.Income     int64
City.Population    int64
Work.Experience    int64
Urban              int32
dtype: object

In [38]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 600 entries, 0 to 599
Data columns (total 6 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Undergrad        600 non-null    int32
 1   Marital.Status   600 non-null    int32
 2   Taxable.Income   600 non-null    int64
 3   City.Population  600 non-null    int64
 4   Work.Experience  600 non-null    int64
 5   Urban            600 non-null    int32
dtypes: int32(3), int64(3)
memory usage: 21.2 KB

In [39]:
df.describe()

,Undergrad,Marital.Status,Taxable.Income,City.Population,Work.Experience,Urban
count,600.000000,600.000000,600.000000,600.000000,600.000000,600.000000
mean,0.520000,1.046667,55208.375000,108747.368333,15.558333,0.503333
std,0.500017,0.821958,26204.827597,49850.075134,8.842147,0.500406
min,0.000000,0.000000,10003.000000,25779.000000,0.000000,0.000000
25%,0.000000,0.000000,32871.500000,66966.750000,8.000000,0.000000
50%,1.000000,1.000000,55074.500000,106493.500000,15.000000,1.000000
75%,1.000000,2.000000,78611.750000,150114.250000,24.000000,1.000000
max,1.000000,2.000000,99619.000000,199778.000000,30.000000,1.000000

In [45]:
df['Taxable.Income'].max()

99619

In [46]:
df['Taxable.Income'].min()

10003

In [47]:
df['Taxable.Income']=df['Taxable.Income'].map(lambda x:1 if x>30000 else 0)
df['Taxable.Income']

0      1
1      0
2      0
3      1
4      1
      ..
595    1
596    1
597    0
598    1
599    1
Name: Taxable.Income, Length: 600, dtype: int64

In [48]:
x=df.drop("Taxable.Income",axis=1)
y=df["Taxable.Income"]

In [49]:
x

     Undergrad  Marital.Status  City.Population  Work.Experience  Urban
0            0               2            50047               10      1
1            1               0           134075               18      1
2            0               1           160205               30      1
3            1               2           193264               15      1
4            0               1            27533               28      0
..         ...             ...              ...              ...    ...
595          1               0            39492                7      1
596          1               0            55369                2      1
597          0               0           154058                0      1
598          1               1           180083               17      0
599          0               0           158137               16      0

[600 rows x 5 columns]

In [50]:
y

0      1
1      0
2      0
3      1
4      1
      ..
595    1
596    1
597    0
598    1
599    1
Name: Taxable.Income, Length: 600, dtype: int64

In [94]:
from sklearn.model_selection import train_test_split
x_train,x_test,y_train,y_test=train_test_split(x,y,test_size=.30,stratify=y)

In [137]:
model=RandomForestClassifier(max_depth=6)
model.fit(x_train,y_train)

RandomForestClassifier(max_depth=6)

In [138]:
y_train_pred=model.predict(x_train)
y_test_pred=model.predict(x_test)

In [139]:
from sklearn.metrics import confusion_matrix,precision_score, accuracy_score

In [140]:
accuracy_score(y_train,y_train_pred)

0.8452380952380952

In [141]:
confusion_matrix(y_train,y_train_pred)

array([[140,  49],
       [ 16, 215]], dtype=int64)

In [142]:
precision_score(y_train,y_train_pred)

0.8143939393939394

In [143]:
accuracy_score(y_test,y_test_pred)

0.5444444444444444

In [144]:
confusion_matrix(y_test,y_test_pred)

array([[29, 52],
       [30, 69]], dtype=int64)

In [145]:
precision_score(y_test,y_test_pred)

0.5702479338842975